const INTRO_TEXT = `Добро пожаловать в таинственный мир "ТАРО ГРАНД ЭТТЕЙЛА"

Вы прикоснулись к одной из самых древних и загадочных колод в истории Таро. Она своенравна, требовательна и не терпит легкомысленности. Её язык ясен лишь тем, кто готов слушать с вниманием и уважением.

Я Ваш цифровой проводник в общении с "Таро Гранд Эттейла". Я помогу Вам понять её характер, уловить смысл её посланий и постичь глубину её символов. Но помните: эта колода открывается лишь тем, кто полностью ей доверяет. Сомнение способно сделать её ответы туманными, двусмысленными или вовсе непостижимыми.

Она не терпит поверхностности. Её сила раскрывается в вопросах судьбы, кармы и духовных поисков. Простые житейские запросы могут остаться без ответа или привести к неожиданным, парадоксальным предсказаниям. Для работы с этой колодой необходимы интуиция, терпение и понимание её особой символики.

Будьте настойчивы и преданы пути тайного знания. И однажды Вы сможете без колебаний взять в руки "живую" колоду "Таро Гранд Эттейла", ощутив её тепло, духовную близость и мудрость прорицаний.`;



const HISTORY_TEXT = [
	`ТАРО ГРАНД ЭТТЕЙЛА
Автор вступления Джордано Берти.

Между 1783 и 1787 годами в Амстердаме и Париже были опубликованы пять брошюр.
Их автором был известный оккультист и мистик Жан Франсуа Альетте (1724 — ок. 1792), более известный под псевдонимом Эттейла. Считается, что его псевдоним представляет его же фамилию, прочитанную каббалистически — справа налево.
🔹 "Manière de se récréer avec le jeu de cartes nommées tarots" ("Способ развлечения с игрой карт, называемых Таро", 1783): первая серьёзная работа о Таро, связывающая карты с древними мистическими традициями.
🔹 "Leçons théoriques et pratiques du livre de Thot" ("Теоретические и практические уроки Книги Тота", 1787): описание системы гадания, связанной с «Книгой Тота».
🔹 "Cahiers du livre de Thot" ("Тетради Книги Тота"): практические заметки и руководства, раскрывающие детали символики.
🔹 "Science, ou art de tirer les cartes" ("Наука, или искусство расклада карт"): практическое пособие по гаданию, расклады и интерпретации.
🔹 "Jeu des tarots, ou le livre de Thot" ("Игра Таро, или Книга Тота"): полное руководство по работе с картами.`,

	`Эттейла утверждал, что игра в Таро содержит в себе расшифровку легендарной «Книги Тота» — бога Луны и мудрости в древнем Египте, — магического трактата, восходящего ко времени становления Египта. По преданию существовали таблицы, на которых, якобы, были начертаны письмена, раскрывающие тайну сотворения мира и человеческой судьбы. По мнению мистика, эта книга появилась в 2170 г. до н.э. как результат собрания магов в храме Амона в Мемфисе. Поэтому Эттейла назвал свои карты Таро — Книга Тота.`,
	`На взгляд Эттейлы, образы Таро за прошедшие тысячелетия кардинально изменились, а поскольку у него было желание восстановить оригинальную форму Таро, то в 1789 г. под его руководством была нарисована серия карт, названная им «Книга Тота или большая игра с 78 египетскими картами Таро». Этой колодой Таро пользовалась знаменитая гадалка мадам Ленорман, которая еще в юности познакомилась в Париже с Эттейлой и стала его ученицей. 
На сегодняшний день от этой серии сохранилось лишь несколько карт, находящихся в частных коллекциях.`,
	`В 1804 г. Мельхиор Монтиминьон д’Одоссе, ученик Эттейлы, организовал новое издание полного набора карт, которое он назвал «Таро Гранд Эттейла». В последующие десятилетия было опубликовано множество справочников и руководств, из которых наибольшего внимания заслуживает работа Джулии Орсини «Таро Гранд Эттейла, или искусство гадания и предсказаний на картах», изданная в Париже в 1840 г. За основу её серии были взяты все 78 карт д’Одоссе, однако имелось несколько существенных отличий.`,
	`Так, к примеру:
🔹 На карте 1-го Аркана вместо Светила изображался Хаос;
🔹 На карте 15-го Аркана проповедник был заменён магом, стоящим перед столом, на котором стояла кукла;
🔹 На карте 21-го Аркана можно увидеть бородатого мужчину со злым взглядом на четырёхколёсной повозке.`,
	`Верхняя и нижняя надписи, как и ранее, поясняют смысл изображений на отдельных картах, что необходимо для точности предсказаний. Помимо этого, на боковой стороне приведена вертикальная надпись с названием символа. 
Так, карта 21-го Аркана имеет своеобразное название «Африканский деспот», а карта 78-го Аркана имеет название «Безумие или Алхимик».`,
	`Вышеназванное издание, получившее у историков название «Таро II Гранд Эттейла», явилось образцом при создании рисунков данной серии, называемой «Таро III Гранд Эттейла», поскольку издательство «Lo Scarabeo» абсолютно точно воспроизвело последний образец, включая название и все надписи на картах. Тот вариант впервые был издан в 1870 г. в Париже под названием «Великая игра — Оракул для дам».`,
	`При сравнении этой серии с более ранними версиями видимое различие заключается в стиле подачи образов, навеянном средними веками. Но всё же на некоторых картах имеются значительные символические изменения.
Например, на карте 12-го Аркана символом "Осмотрительность" становится девушка с зеркалом в руке, рукоятку которого обвивает змея. 
Зато "Сдержанность" на карте 10-го Аркана превратилась в женщину, удерживающую коня за мундштук в его узде.`,
	`Но все надписи на картах остались абсолютно неизменными. Следует подчеркнуть то обстоятельство, что, несмотря на эти нюансы, все используемые в предсказаниях толкования берут своё начало в традиционных по содержанию образах книги Джулии Орсини. Их можно считать классическими, т.к. они вдохновляли наиболее известных эзотериков, таких, например, как Самуэль Лиделл Матерс, Жерар Энкосс (доктор Папюс), Элистер Кроули, Филбис.`];


const TAROTH_TEXT = `ТОЛКОВАНИЕ АРКАНОВ ТАРО

Колода «Таро Гранд Эттейлы» содержит 78 карт.
Все карты делятся на три основные группы, каждая из которых имеет своё значение:
🔹 22 Старших Аркана (Lame Superiori) — отражают суть и природу ситуации. Они обозначены номерами от 0 до 21.
🔹 16 Средних Арканов (Lame Mediane) — символизируют людей, вовлечённых в ситуацию. Их также называют «Придворными картами». Эти карты имеют номера 22–25, 36–39, 50–53 и 64–67.
🔹 40 Младших Арканов (Lame Inferiori) — представляют собой идеи, действия или эмоции, лежащие в основе ситуации.
Каждая из 78 карт имеет по два толкования в зависимости от положения в раскладе — прямого или перевёрнутого.`;


const HEQET_TEXT = [
    `РАСКЛАД «Прыжок Хекет»

Для гадания существует особый расклад «Прыжок Хекет» (Salto di Heqt), основанный на образе египетской богини возрождения.
Хекет — древнеегипетская богиня плодородия, покровительница рожениц и проводница душ в загробный мир. Согласно мифам, именно она даровала людям жизнь. Её традиционно изображали в виде лягушки, символизирующей цикличность, возрождение и движение вперёд.
В этом раскладе каждая карта располагается в соответствии с частями тела лягушки, отражая их символическое значение:
🔹 Мордочка: Первая карта - «Будущее», «Дом Целей»
🔹 Голова: Вторая карта - «Настоящее», «Дом Мысли»;
🔹 Спина: Третья карта - «Прошлое», «Дом Бремени»;
🔹 Задние лапки: Четвертая карта - «Содействие», «Дом Силы и Поддержки»;
🔹 Передние лапки: Пятая карта - «Противодействие», «Дом Контроля и Подавления».`,

    `Расклад «Прыжок Хекет» разбит на две части:
🔹 Первая часть расклада анализирует ситуацию в контексте вопроса Вопрошающего, выявляя её причины и возможные последствия. Также рассматриваются силы или обстоятельства, способствующие или препятствующие благоприятному развитию событий.
🔹 Вторая часть расклада характеризует самого Вопрошающего в контексте сложившейся ситуации. Она раскрывает его эмоциональное состояние, мысли и стремления. Также рассматриваются сильные и слабые стороны его личности, союзники и противники, способные повлиять на благоприятное развитие событий.`
];



